Revit 2024 API
BuiltInFailures.DesignOptionFailures.CannotPutSpaceInOption Property
 MEP space must be in the Main Model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPutSpaceInOption { get; }
Visual Basic
Public Shared ReadOnly Property CannotPutSpaceInOption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPutSpaceInOption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace